seonghoYi/ATMEGA_fw/ATMEGA_fw/ATMEGA_fw/src/lib/Drivers/Src/atmega128_DRV_timer.c
#include "atmega128_DRV.h"

#ifdef DRV_TIMER_MODULE_ENABLED

TIM8_TypeDef TIM8_descripter[] = {
	{&TCCR0, &TCNT0, &OCR0, &ASSR},
	{&TCCR2, &TCNT2, &OCR2, NULL}
};

TIM16_TypeDef TIM16_descripter[] = {
	{&TCCR1A, &TCCR1B, &TCCR1C, &TCNT1L,&TCNT1H, &OCR1AL, &OCR1AH, &OCR1BL, &OCR1BH, &ICR1L, &ICR1H},
	{&TCCR3A, &TCCR3B, &TCCR3C, &TCNT3L,&TCNT3H, &OCR3AL, &OCR3AH, &OCR3BL, &OCR3BH, &ICR3L, &ICR3H}
};




void TIM0_CLK_Configuration(TIM8_HandleTypeDef *htim);
void TIM2_CLK_Configuration(TIM8_HandleTypeDef *htim);
void TIM1_CLK_Configuration(TIM16_HandleTypeDef *htim);
void TIM3_CLK_Configuration(TIM16_HandleTypeDef *htim);


StatusTypeDef TIM8_Base_Init(TIM8_HandleTypeDef *htim)
{
	TIM8_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM0:
		tim = &TIM8_descripter[0];
		break;
		case TIM2:
		tim = &TIM8_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	
	htim->Regs = tim;

	if (htim->TIMn == TIM2)
	{
		switch(htim->Init.Source)
		{
			case TIM_INTCLK_SOURCE:
			break;
			case TIM_EXTCLK_FALLING:
			*(tim->TCCRn) &= ~0x07;
			SETB(*(tim->TCCRn), 2);
			SETB(*(tim->TCCRn), 1);
			CLRB(*(tim->TCCRn), 0);
			break;
			case TIM_EXTCLK_RISING:
			*(tim->TCCRn) &= ~0x07;
			SETB(*(tim->TCCRn), 2);
			SETB(*(tim->TCCRn), 1);
			SETB(*(tim->TCCRn), 0);
			break;
			default:
			break;
		}
	}
	
	return OK;
}


StatusTypeDef TIM8_Base_Start(TIM8_HandleTypeDef *htim)
{
	TIM8_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM0:
		tim = &TIM8_descripter[0];
		break;
		case TIM2:
		tim = &TIM8_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	
	*(tim->TCNTn) = htim->Init.Tcnt;
	
	switch(htim->TIMn)
	{
		case TIM0:
		TIM0_CLK_Configuration(htim);
		break;
		case TIM2:
		TIM2_CLK_Configuration(htim);
		break;
		default:
		break;
	}
	
	return OK;
}

StatusTypeDef TIM8_Base_Stop(TIM8_HandleTypeDef *htim)
{
	TIM8_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM0:
		tim = &TIM8_descripter[0];
		break;
		case TIM2:
		tim = &TIM8_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	*(tim->TCCRn) &= ~0x07;
	return OK;
}

StatusTypeDef TIM8_OC_Init(TIM8_HandleTypeDef *htim, TIM8_OC_InitTypeDef *htim_oc)
{
	TIM8_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM0:
		tim = &TIM8_descripter[0];
		break;
		case TIM2:
		tim = &TIM8_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	
	
	TIM8_Base_Init(htim);
	switch(htim_oc->OCMode)
	{
		case TIM8_OC_MOD_NORMAL:
		CLRB((*tim->TCCRn), 6);
		CLRB((*tim->TCCRn), 3);
		break;
		case TIM8_OC_MOD_CTC:
		CLRB((*tim->TCCRn), 6);
		SETB((*tim->TCCRn), 3);
		break;
		default:
		break;
	}
	
	switch(htim_oc->OCOutput)
	{
		case TIM8_OC_NORMALOUT:
		CLRB((*tim->TCCRn), 7);
		break;
		case TIM8_OC_FORCEDOUT:
		SETB((*tim->TCCRn), 7);
		break;
		default:
		break;
	}
	
	switch(htim_oc->OCWave_COM)
	{
		case TIM8_OC_COM_NORMAL:
		CLRB((*tim->TCCRn), 4);
		CLRB((*tim->TCCRn), 5);
		break;
		case TIM8_OC_COM_TOGGLE:
		SETB((*tim->TCCRn), 4);
		CLRB((*tim->TCCRn), 5);
		break;
		case TIM8_OC_COM_CLR:
		CLRB((*tim->TCCRn), 4);
		SETB((*tim->TCCRn), 5);
		break;
		case TIM8_OC_COM_SET:
		SETB((*tim->TCCRn), 4);
		SETB((*tim->TCCRn), 5);
		break;
		default:
		break;
	}
	
	(*tim->OCRn) = htim_oc->Ocr;
	(*tim->TCNTn) = htim_oc->Tcnt;
	
	return OK;
}

StatusTypeDef TIM8_OC_Start(TIM8_HandleTypeDef *htim)
{
	TIM8_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM0:
		tim = &TIM8_descripter[0];
		break;
		case TIM2:
		tim = &TIM8_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	
	*(tim->TCNTn) = htim->Init.Tcnt;
	
	switch(htim->TIMn)
	{
		case TIM0:
		TIM0_CLK_Configuration(htim);
		break;
		case TIM2:
		TIM2_CLK_Configuration(htim);
		break;
		default:
		break;
	}
	return OK;
}

StatusTypeDef TIM8_OC_Stop(TIM8_HandleTypeDef *htim)
{
	TIM8_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM0:
		tim = &TIM8_descripter[0];
		break;
		case TIM2:
		tim = &TIM8_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	*(tim->TCCRn) &= ~0x07;
	return OK;
}

StatusTypeDef TIM8_PWM_Init(TIM8_HandleTypeDef *htim, TIM8_PWM_InitTypeDef *htim_pwm)
{
	TIM8_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM0:
		tim = &TIM8_descripter[0];
		break;
		case TIM2:
		tim = &TIM8_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	TIM8_Base_Init(htim);
	
	switch(htim_pwm->PWMMode)
	{
		case TIM8_PWM_MOD_FASTPWM:
		SETB(*(tim->TCCRn), 3);
		SETB(*(tim->TCCRn), 6);
		break;
		case TIM8_PWM_MOD_PCPWM:
		SETB(*(tim->TCCRn), 3);
		CLRB(*(tim->TCCRn), 6);
		break;
		default:
		break;
	}
	
	switch(htim_pwm->PWMWave_COM)
	{
		case TIM8_PWM_COM_NORMAL:
		CLRB((*tim->TCCRn), 4);
		CLRB((*tim->TCCRn), 5);
		break;
		case TIM8_PWM_COM_NONINV:
		CLRB((*tim->TCCRn), 4);
		SETB((*tim->TCCRn), 5);
		break;
		case TIM8_PWM_COM_INV:
		SETB((*tim->TCCRn), 4);
		SETB((*tim->TCCRn), 5);
		break;
		default:
		break;
	}
	
	return OK;
}

StatusTypeDef TIM8_PWM_Start(TIM8_HandleTypeDef *htim)
{
	TIM8_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM0:
		tim = &TIM8_descripter[0];
		break;
		case TIM2:
		tim = &TIM8_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	
	switch(htim->TIMn)
	{
		case TIM0:
		TIM0_CLK_Configuration(htim);
		break;
		case TIM2:
		TIM2_CLK_Configuration(htim);
		break;
		default:
		break;
	}
	return OK;
}

StatusTypeDef TIM8_PWM_Stop(TIM8_HandleTypeDef *htim)
{
	TIM8_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM0:
		tim = &TIM8_descripter[0];
		break;
		case TIM2:
		tim = &TIM8_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	*(tim->TCCRn) &= ~0x07;
	return OK;
}


StatusTypeDef TIM8_Base_Start_IT(TIM8_HandleTypeDef *htim)
{
	switch(htim->TIMn)
	{
		case TIM0:
		SETB(TIMSK, 0);
		break;
		case TIM2:
		SETB(TIMSK, 6);
		break;
		default:
		break;
	}
	TIM8_Base_Start(htim);
	
	return OK;
}

StatusTypeDef TIM8_Base_Stop_IT(TIM8_HandleTypeDef *htim)
{
	switch(htim->TIMn)
	{
		case TIM0:
		CLRB(TIMSK, 0);
		break;
		case TIM2:
		CLRB(TIMSK, 6);
		break;
		default:
		break;
	}
	TIM8_Base_Stop(htim);
	
	return OK;
}

StatusTypeDef TIM8_OC_Start_IT(TIM8_HandleTypeDef *htim)
{
	switch(htim->TIMn)
	{
		case TIM0:
		SETB(TIMSK, 1);
		break;
		case TIM2:
		SETB(TIMSK, 7);
		break;
		default:
		break;
	}
	TIM8_OC_Start(htim);
	
	return OK;
}

StatusTypeDef TIM8_OC_Stop_IT(TIM8_HandleTypeDef *htim)
{
	switch(htim->TIMn)
	{
		case TIM0:
		CLRB(TIMSK, 1);
		break;
		case TIM2:
		CLRB(TIMSK, 7);
		break;
		default:
		break;
	}
	TIM8_OC_Stop(htim);
	
	return OK;
}



StatusTypeDef TIM16_Base_Init(TIM16_HandleTypeDef *htim)
{
	TIM16_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM1:
		tim = &TIM16_descripter[0];
		break;
		case TIM3:
		tim = &TIM16_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	
	htim->Regs = tim;
	
	switch(htim->Init.Source)
	{
		case TIM_INTCLK_SOURCE:
		break;
		case TIM_EXTCLK_FALLING:
		*(tim->TCCRnB) &= ~0x07;
		SETB(*(tim->TCCRnB), 2);
		SETB(*(tim->TCCRnB), 1);
		CLRB(*(tim->TCCRnB), 0);
		break;
		case TIM_EXTCLK_RISING:
		*(tim->TCCRnB) &= ~0x07;
		SETB(*(tim->TCCRnB), 2);
		SETB(*(tim->TCCRnB), 1);
		SETB(*(tim->TCCRnB), 0);
		break;
		default:
		break;
	}
	
	return OK;
}

StatusTypeDef TIM16_Base_Start(TIM16_HandleTypeDef *htim)
{
	TIM16_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM1:
		tim = &TIM16_descripter[0];
		break;
		case TIM3:
		tim = &TIM16_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	
