seonghoYi/ATMEGA_fw/ATMEGA_fw/ATMEGA_fw/src/lib/Drivers/Src/atmega128_DRV_timer.c
StatusTypeDef TIM16_PWM_Start(TIM16_HandleTypeDef *htim)
{
	TIM16_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM1:
		tim = &TIM16_descripter[0];
		break;
		case TIM3:
		tim = &TIM16_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	
	switch(htim->TIMn)
	{
		case TIM1:
		TIM1_CLK_Configuration(htim);
		break;
		case TIM3:
		TIM3_CLK_Configuration(htim);
		break;
		default:
		break;
	}
	
	return OK;
}
StatusTypeDef TIM16_PWM_Stop(TIM16_HandleTypeDef *htim)
{
	TIM16_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM1:
		tim = &TIM16_descripter[0];
		break;
		case TIM3:
		tim = &TIM16_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	*(tim->TCCRnB) &= ~0x07;
	return OK;
}

StatusTypeDef TIM16_IC_Init(TIM16_HandleTypeDef *htim, TIM16_IC_InitTypeDef *htim_ic)
{
	TIM16_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM1:
		tim = &TIM16_descripter[0];
		break;
		case TIM3:
		tim = &TIM16_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	return OK;
}
StatusTypeDef TIM16_IC_Start(TIM16_HandleTypeDef *htim)
{
	TIM16_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM1:
		tim = &TIM16_descripter[0];
		break;
		case TIM3:
		tim = &TIM16_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	return OK;
}
StatusTypeDef TIM16_IC_Stop(TIM16_HandleTypeDef *htim)
{
	TIM16_TypeDef *tim = NULL;
	switch(htim->TIMn)
	{
		case TIM1:
		tim = &TIM16_descripter[0];
		break;
		case TIM3:
		tim = &TIM16_descripter[1];
		break;
		default:
		break;
	}
	
	if (tim == NULL)
	{
		return ERROR;
	}
	return OK;
}

StatusTypeDef TIM16_Base_Start_IT(TIM16_HandleTypeDef *htim)
{
	switch(htim->TIMn)
	{
		case TIM1:
		SETB(TIMSK, 2);
		break;
		case TIM3:
		SETB(ETIMSK, 2);
		break;
		default:
		break;
	}
	TIM16_Base_Start(htim);
	
	return OK;
}
StatusTypeDef TIM16_Base_Stop_IT(TIM16_HandleTypeDef *htim)
{
	switch(htim->TIMn)
	{
		case TIM1:
		CLRB(TIMSK, 2);
		break;
		case TIM3:
		CLRB(ETIMSK, 2);
		break;
		default:
		break;
	}
	TIM16_Base_Stop(htim);
	return OK;
}
StatusTypeDef TIM16_OC_Start_IT(TIM16_HandleTypeDef *htim)
{
	if (htim->Init.Channel == TIM16_CHANNEL_A)
	{
		switch(htim->TIMn)
		{
			case TIM1:
			SETB(TIMSK, 4);
			break;
			case TIM3:
			SETB(ETIMSK, 4);
			break;
			default:
			break;
		}
	}
	else if (htim->Init.Channel == TIM16_CHANNEL_B)
	{
		switch(htim->TIMn)
		{
			case TIM1:
			SETB(TIMSK, 3);
			break;
			case TIM3:
			SETB(ETIMSK, 3);
			break;
			default:
			break;
		}
	}
	else if (htim->Init.Channel == TIM16_CHANNEL_C)
	{
		switch(htim->TIMn)
		{
			case TIM1:
			SETB(ETIMSK, 0);
			break;
			case TIM3:
			SETB(ETIMSK, 1);
			break;
			default:
			break;
		}
	}
	TIM16_OC_Start(htim);
	
	return OK;
}
StatusTypeDef TIM16_OC_Stop_IT(TIM16_HandleTypeDef *htim)
{
	if (htim->Init.Channel == TIM16_CHANNEL_A)
	{
		switch(htim->TIMn)
		{
			case TIM1:
			CLRB(TIMSK, 4);
			break;
			case TIM3:
			CLRB(ETIMSK, 4);
			break;
			default:
			break;
		}
	}
	else if (htim->Init.Channel == TIM16_CHANNEL_B)
	{
		switch(htim->TIMn)
		{
			case TIM1:
			CLRB(TIMSK, 3);
			break;
			case TIM3:
			CLRB(ETIMSK, 3);
			break;
			default:
			break;
		}
	}
	else if (htim->Init.Channel == TIM16_CHANNEL_C)
	{
		switch(htim->TIMn)
		{
			case TIM1:
			CLRB(ETIMSK, 0);
			break;
			case TIM3:
			CLRB(ETIMSK, 1);
			break;
			default:
			break;
		}
	}
	TIM16_OC_Stop(htim);
	return OK;
}

StatusTypeDef TIM16_IC_Start_IT(TIM16_HandleTypeDef *htim)
{
	switch(htim->TIMn)
	{
		case TIM1:
		SETB(TIMSK, 5);
		break;
		case TIM3:
		SETB(ETIMSK, 5);
		break;
		default:
		break;
	}
	TIM16_IC_Start(htim);
	return OK;
}

StatusTypeDef TIM16_IC_Stop_IT(TIM16_HandleTypeDef *htim)
{
	switch(htim->TIMn)
	{
		case TIM1:
		CLRB(TIMSK, 5);
		break;
		case TIM3:
		CLRB(ETIMSK, 5);
		break;
		default:
		break;
	}
	TIM16_IC_Stop(htim);
	return OK;
}


void TIM0_CLK_Configuration(TIM8_HandleTypeDef *htim)
{
	TIM8_TypeDef *tim = &TIM8_descripter[0];
	
	switch(htim->Init.Prescaler)
	{
		case TIM_CLK_PRESCALER_1:
		CLRB(*(tim->TCCRn), 2);
		CLRB(*(tim->TCCRn), 1);
		SETB(*(tim->TCCRn), 0);
		break;
		case TIM_CLK_PRESCALER_8:
		CLRB(*(tim->TCCRn), 2);
		SETB(*(tim->TCCRn), 1);
		CLRB(*(tim->TCCRn), 0);
		break;
		case TIM_CLK_PRESCALER_32:
		CLRB(*(tim->TCCRn), 2);
		SETB(*(tim->TCCRn), 1);
		SETB(*(tim->TCCRn), 0);
		break;
		case TIM_CLK_PRESCALER_64:
		SETB(*(tim->TCCRn), 2);
		CLRB(*(tim->TCCRn), 1);
		CLRB(*(tim->TCCRn), 0);
		break;
		case TIM_CLK_PRESCALER_128:
		SETB(*(tim->TCCRn), 2);
		CLRB(*(tim->TCCRn), 1);
		SETB(*(tim->TCCRn), 0);
		break;
		case TIM_CLK_PRESCALER_256:
		SETB(*(tim->TCCRn), 2);
		SETB(*(tim->TCCRn), 1);
		CLRB(*(tim->TCCRn), 0);
		break;
		case TIM_CLK_PRESCALER_1024:
		SETB(*(tim->TCCRn), 2);
		SETB(*(tim->TCCRn), 1);
		SETB(*(tim->TCCRn), 0);
		break;
		default:
		break;
	}
}

void TIM2_CLK_Configuration(TIM8_HandleTypeDef *htim)
{
	TIM8_TypeDef *tim = &TIM8_descripter[1];
	
	if ((*(tim->TCCRn) & 0x03) == 0x06 || (*(tim->TCCRn) & 0x03) == 0x07)
		return;
	
	switch(htim->Init.Prescaler)
	{
		case TIM_CLK_PRESCALER_1:
		CLRB(*(tim->TCCRn), 2);
		CLRB(*(tim->TCCRn), 1);
		SETB(*(tim->TCCRn), 0);
		break;
		case TIM_CLK_PRESCALER_8:
		CLRB(*(tim->TCCRn), 2);
		SETB(*(tim->TCCRn), 1);
		CLRB(*(tim->TCCRn), 0);
		break;
		case TIM_CLK_PRESCALER_64:
		CLRB(*(tim->TCCRn), 2);
		SETB(*(tim->TCCRn), 1);
		SETB(*(tim->TCCRn), 0);
		break;
		case TIM_CLK_PRESCALER_256:
		SETB(*(tim->TCCRn), 2);
		CLRB(*(tim->TCCRn), 1);
		CLRB(*(tim->TCCRn), 0);
		break;
		case TIM_CLK_PRESCALER_1024:
		SETB(*(tim->TCCRn), 2);
		CLRB(*(tim->TCCRn), 1);
		SETB(*(tim->TCCRn), 0);
		break;
		default:
		break;
	}
}

void TIM1_CLK_Configuration(TIM16_HandleTypeDef *htim)
{
	TIM16_TypeDef *tim = &TIM16_descripter[0];
	
	if ((*(tim->TCCRnB) & 0x03) == 0x06 || (*(tim->TCCRnB) & 0x03) == 0x07)
		return;
	
	switch(htim->Init.Prescaler)
	{
		case TIM_CLK_PRESCALER_1:
		CLRB(*(tim->TCCRnB), 2);
		CLRB(*(tim->TCCRnB), 1);
		SETB(*(tim->TCCRnB), 0);
		break;
		case TIM_CLK_PRESCALER_8:
		CLRB(*(tim->TCCRnB), 2);
		SETB(*(tim->TCCRnB), 1);
		CLRB(*(tim->TCCRnB), 0);
		break;
		case TIM_CLK_PRESCALER_64:
		CLRB(*(tim->TCCRnB), 2);
		SETB(*(tim->TCCRnB), 1);
		SETB(*(tim->TCCRnB), 0);
		break;
		case TIM_CLK_PRESCALER_256:
		SETB(*(tim->TCCRnB), 2);
		CLRB(*(tim->TCCRnB), 1);
		CLRB(*(tim->TCCRnB), 0);
		break;
		case TIM_CLK_PRESCALER_1024:
		SETB(*(tim->TCCRnB), 2);
		CLRB(*(tim->TCCRnB), 1);
		SETB(*(tim->TCCRnB), 0);
		break;
		default:
		break;
	}
}

void TIM3_CLK_Configuration(TIM16_HandleTypeDef *htim)
{
	TIM16_TypeDef *tim = &TIM16_descripter[1];
	
	if ((*(tim->TCCRnB) & 0x03) == 0x06 || (*(tim->TCCRnB) & 0x03) == 0x07)
		return;
	
	switch(htim->Init.Prescaler)
	{
		case TIM_CLK_PRESCALER_1:
		CLRB(*(tim->TCCRnB), 2);
		CLRB(*(tim->TCCRnB), 1);
		SETB(*(tim->TCCRnB), 0);
		break;
		case TIM_CLK_PRESCALER_8:
		CLRB(*(tim->TCCRnB), 2);
		SETB(*(tim->TCCRnB), 1);
		CLRB(*(tim->TCCRnB), 0);
		break;
		case TIM_CLK_PRESCALER_64:
		CLRB(*(tim->TCCRnB), 2);
		SETB(*(tim->TCCRnB), 1);
		SETB(*(tim->TCCRnB), 0);
		break;
		case TIM_CLK_PRESCALER_256:
		SETB(*(tim->TCCRnB), 2);
		CLRB(*(tim->TCCRnB), 1);
		CLRB(*(tim->TCCRnB), 0);
		break;
		case TIM_CLK_PRESCALER_1024:
		SETB(*(tim->TCCRnB), 2);
		CLRB(*(tim->TCCRnB), 1);
		SETB(*(tim->TCCRnB), 0);
		break;
		default:
		break;
	}
}


void TIM0_OVF_IRQHandler(TIM8_HandleTypeDef *htim)
{
	TIM0_OVF_ElapsedCallback(htim);
}
void TIM1_OVF_IRQHandler(TIM16_HandleTypeDef *htim)
{
	TIM1_OVF_ElapsedCallback(htim);
}
void TIM2_OVF_IRQHandler(TIM8_HandleTypeDef *htim)
{
	TIM2_OVF_ElapsedCallback(htim);
}
void TIM3_OVF_IRQHandler(TIM16_HandleTypeDef *htim)
{
	TIM3_OVF_ElapsedCallback(htim);
}

void TIM0_OC_IRQHandler(TIM8_HandleTypeDef *htim)
{
	TIM0_OC_ElapsedCallback(htim);	
}

void TIM2_OC_IRQHandler(TIM8_HandleTypeDef *htim)
{
	TIM2_OC_ElapsedCallback(htim);
}

void TIM1_OCA_IRQHandler(TIM16_HandleTypeDef *htim)
{
	TIM1_OCA_ElapsedCallback(htim);
}

void TIM1_OCB_IRQHandler(TIM16_HandleTypeDef *htim)
{
	TIM1_OCB_ElapsedCallback(htim);
}

