seonghoYi/ATMEGA_fw/ATMEGA_fw/ATMEGA_fw/src/lib/Drivers/Src/atmega128_DRV_timer.c
void TIM1_OCC_IRQHandler(TIM16_HandleTypeDef *htim)
{
	TIM1_OCC_ElapsedCallback(htim);
}

void TIM1_CAPT_IRQHandler(TIM16_HandleTypeDef *htim)
{
	TIM1_CAPT_CpltCallback(htim);
}

void TIM3_OCA_IRQHandler(TIM16_HandleTypeDef *htim)
{
	TIM3_OCA_ElapsedCallback(htim);	
}

void TIM3_OCB_IRQHandler(TIM16_HandleTypeDef *htim)
{
	TIM3_OCB_ElapsedCallback(htim);
}

void TIM3_OCC_IRQHandler(TIM16_HandleTypeDef *htim)
{
	TIM3_OCC_ElapsedCallback(htim);
}

void TIM3_CAPT_IRQHandler(TIM16_HandleTypeDef *htim)
{
	TIM3_CAPT_CpltCallback(htim);
}

__attribute__((weak)) void TIM0_OVF_ElapsedCallback(TIM8_HandleTypeDef *htim)
{
	UNUSED(htim);
}

__attribute__((weak)) void TIM1_OVF_ElapsedCallback(TIM16_HandleTypeDef *htim)
{
	UNUSED(htim);
}

__attribute__((weak)) void TIM2_OVF_ElapsedCallback(TIM8_HandleTypeDef *htim)
{
	UNUSED(htim);
}

__attribute__((weak)) void TIM3_OVF_ElapsedCallback(TIM16_HandleTypeDef *htim)
{
	UNUSED(htim);
}

__attribute__((weak)) void TIM0_OC_ElapsedCallback(TIM8_HandleTypeDef *htim)
{
	UNUSED(htim);
}

__attribute__((weak)) void TIM2_OC_ElapsedCallback(TIM8_HandleTypeDef *htim)
{
	UNUSED(htim);
}

__attribute__((weak)) void TIM1_OCA_ElapsedCallback(TIM16_HandleTypeDef *htim)
{
	UNUSED(htim);
}

__attribute__((weak)) void TIM1_OCB_ElapsedCallback(TIM16_HandleTypeDef *htim)
{
	UNUSED(htim);
}

__attribute__((weak)) void TIM1_OCC_ElapsedCallback(TIM16_HandleTypeDef *htim)
{
	UNUSED(htim);
}

__attribute__((weak)) void TIM1_CAPT_CpltCallback(TIM16_HandleTypeDef *htim)
{
	UNUSED(htim);
}

__attribute__((weak)) void TIM3_OCA_ElapsedCallback(TIM16_HandleTypeDef *htim)
{
	UNUSED(htim);
}

__attribute__((weak)) void TIM3_OCB_ElapsedCallback(TIM16_HandleTypeDef *htim)
{
	UNUSED(htim);
}

__attribute__((weak)) void TIM3_OCC_ElapsedCallback(TIM16_HandleTypeDef *htim)
{
	UNUSED(htim);
}

__attribute__((weak)) void TIM3_CAPT_CpltCallback(TIM16_HandleTypeDef *htim)
{
	UNUSED(htim);
}


#endif